In [1]:
import pandas as pd
print(pd.__version__)

1.3.4

In [2]:
df = pd.DataFrame({'marks_out_of_25': [10, 23, 14, 25]},
                  index=['Sarah', 'Shreyansh', 'Atul', 'Roshan'])
df

           marks_out_of_25
Sarah                   10
Shreyansh               23
Atul                    14
Roshan                  25

In [3]:
df.assign(percentage=lambda x: x.marks_out_of_25 * 4)

           marks_out_of_25  percentage
Sarah                   10          40
Shreyansh               23          92
Atul                    14          56
Roshan                  25         100

In [4]:
arr = {'X': [215,325,185,332,406,522,412,614,544,421,445,408], 'Y': [14.2,16.4,11.9,15.2,18.5,22.1,19.4,25.1,23.4,18.1,22.6,17.2]}
df = pd.DataFrame(data=arr)
df.columns = [  'Lemonade_Sales',  'Temperature_°C']
df

    Lemonade_Sales  Temperature_°C
0              215            14.2
1              325            16.4
2              185            11.9
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [5]:
df[df['Lemonade_Sales']> 250]

    Lemonade_Sales  Temperature_°C
1              325            16.4
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [6]:
df[df['Temperature_°C']>23][['Temperature_°C', 'Lemonade_Sales']]

   Temperature_°C  Lemonade_Sales
7            25.1             614
8            23.4             544

In [7]:
df = pd.DataFrame(data=arr)
df.columns = [  'Lemonade_Sales',  'Temperature_°C']
df

    Lemonade_Sales  Temperature_°C
0              215            14.2
1              325            16.4
2              185            11.9
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [8]:
df[(df['Temperature_°C']>18)  |  (df['Lemonade_Sales']<300)]

    Lemonade_Sales  Temperature_°C
0              215            14.2
2              185            11.9
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6

In [9]:
import numpy as np

In [10]:
arr = {'A':[1,2,np.nan],'B':[5, np.nan, np.nan],'C':[1,2,3]}

In [11]:
df = pd.DataFrame(arr)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [15]:
first = ['F1', 'F1', 'F1', 'F2', 'F2', 'F2']
second = [1,2,3,1,2,3]
top_index = list(zip(first, second))
top_index = pd.MultiIndex.from_tuples(top_index)

In [16]:
df = pd.DataFrame(np.random.randn(6,2), top_index, ['A', 'B'])
df

             A         B
F1 1 -0.242874 -0.942123
   2 -1.131421  0.751277
   3  0.810794  0.793413
F2 1 -0.538703  1.016668
   2  0.546939  1.235266
   3  0.883745 -2.384056

In [17]:
df.loc['F1']

          A         B
1 -0.242874 -0.942123
2 -1.131421  0.751277
3  0.810794  0.793413

In [18]:
df.loc['F2']

          A         B
1 -0.538703  1.016668
2  0.546939  1.235266
3  0.883745 -2.384056

In [19]:
df.loc['F2'].loc[1]

A   -0.538703
B    1.016668
Name: 1, dtype: float64

In [20]:
df.loc['F1'].loc[1][0]

-0.2428739471323308

In [21]:
df.index.names

FrozenList([None, None])

In [22]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
F1     1   -0.242874 -0.942123
       2   -1.131421  0.751277
       3    0.810794  0.793413
F2     1   -0.538703  1.016668
       2    0.546939  1.235266
       3    0.883745 -2.384056

In [23]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
F1     1   -0.242874 -0.942123
       2   -1.131421  0.751277
       3    0.810794  0.793413
F2     1   -0.538703  1.016668
       2    0.546939  1.235266
       3    0.883745 -2.384056

In [3]:
import numpy as np
import pandas as pd
dict_a = {
   "name": ["John", "Jane", "Emily"],
   "height": [178, 175, 177],
   "age": [25, 22, 27]
}
df = pd.DataFrame(dict_a)
df

    name  height  age
0   John     178   25
1   Jane     175   22
2  Emily     177   27

In [5]:
dict_b = {
   "date": pd.date_range("2020-01-01", periods=5, freq="D"),
   "store": "A",
   "sales": np.random.randint(50, 100, size=5)
}
df = pd.DataFrame(dict_b)
df

        date store  sales
0 2020-01-01     A     97
1 2020-01-02     A     59
2 2020-01-03     A     85
3 2020-01-04     A     94
4 2020-01-05     A     98